{
  "tones": {
    "Adventurous": "Shows a willingness to take risks or try out new experiences.",
    "Amusing": "Causes lighthearted laughter or provides entertainment in a playful way.",
    "Angry": "Expresses strong annoyance, displeasure, or hostility towards an event.",
    "Anxious": "Shows a feeling of worry, nervousness, or unease about an uncertain outcome.",
    "Appreciative": "Expresses gratitude, admiration, or praise for an action or event.",
    "Assertive": "Expresses opinions or desires confidently and forcefully.",
    "Bewildered": "Shows a feeling of being perplexed and confused.",
    "Calm": "Expresses a state of peace, untroubled by disturbance or strong emotion.",
    "Caring": "Displays kindness and concern for others.",
    "Casual": "Relaxed and unconcerned; informal.",
    "Considerate": "Shows careful thought and concern for the well-being or safety of others.",
    "Critical": "Expresses disapproving comments or judgments about an action or behavior.",
    "Curious": "Eager to know or learn something.",
    "Cynical": "Shows a distrust of others' sincerity or integrity.",
    "Dramatic": "Relating to excitement or drama; attracting attention.",
    "Emotional": "Expresses feelings openly and strongly, such as happiness, sadness, or fear.",
    "Energetic": "Displays a high level of activity, excitement, or dynamism.",
    "Enthusiastic": "Shows intense and eager enjoyment or interest in an event.",
    "Exciting": "Causing great enthusiasm and eagerness.",
    "Humorous": "Causing lighthearted laughter and amusement; comic.",
    "Objective": "Presents information without personal feelings or bias; neutral.",
    "Observant": "States facts or details about an event in a neutral, notice-based way.",
    "Opinionated": "Conceitedly assertive and dogmatic in one's opinions.",
    "Optimistic": "Shows hopefulness and confidence about the future or the successful outcome of something.",
    "Passionate": "Showing or caused by strong feelings or beliefs.",
    "Playful": "Light-hearted and full of fun.",
    "Questioning": "Raises questions or expresses uncertainty about a situation.",
    "Reflective": "Shows deep thought or contemplation about an event or idea.",
    "Sarcastic": "Uses irony or mockery to convey contempt, often by saying the opposite of what is meant.",
    "Serious": "Treats the subject with gravity and importance, without humor.",
    "Tense": "Expresses a state of mental or nervous strain; nervousness.",
    "Thoughtful": "Absorbed in or involving thought; showing consideration for others."
  },
  "writing_styles": {
    "Advisory": "Gives advice, suggestions, or warnings about a situation.",
    "CallToAction": "Encourages the reader to take a specific action.",
    "Conversational": "Uses an informal, personal, and chatty style, as if talking directly to a friend.",
    "Exaggeration": "Represents something as being larger, better, or worse than it really is for effect.",
    "Factual": "Presents information objectively and accurately, like a news report.",
    "Instructional": "Provides clear directions or information on how to do something.",
    "Judgmental": "Displays an overly critical or moralizing point of view on actions shown.",
    "Metaphorical": "Uses symbolic language or comparisons to describe something.",
    "Motivational": "Intended to promote enthusiasm or action in others.",
    "Persuasive": "Aims to convince the reader to agree with a particular point of view.",
    "Pop Culture References": "Uses references to popular media (films, music, etc.) to make a point.",
    "Proverbial": "Uses well-known proverbs or sayings to convey wisdom.",
    "Rhetorical Question": "Asks a question not for an answer, but to make a point or create a dramatic effect.",
    "Analogy": "Explains or clarifies an idea by comparing it to something familiar that shares similar characteristics."
  },
  "applications": {
    "Driver Behavior Monitoring": "Used in systems that track and analyze driving patterns for insurance or fleet management.",
    "Law Enforcement Reporting": "A direct report or tag to police to bring a specific violation to their attention for enforcement.",
    "Public Safety Alert": "Intended to inform the public about potential dangers or safety issues.",
    "Urban Traffic Observation": "A post commenting on the nature or state of traffic in a city environment.",
    "ADAS Alert": "A notification or post related to the functioning, activation, or failure of an Advanced Driver-Assistance System.",
    "Traffic Management Insight": "Information that could help authorities or systems monitor and manage traffic flow, congestion, or road conditions in real time.",
    "Public Safety Education": "Intended to teach or remind drivers and pedestrians about safe road practices and rule compliance.",
    "Incident Analytics": "Used for aggregating or analyzing road incidents, near-misses, or violation data for research and safety improvement."
  }
}